{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020, 2021)",
        "GPA: 3.0."
      ],
      "degree": "Bachelor of Engineering",
      "department": "Engineering and Applied Science",
      "duration": "2017-2022",
      "school_name": "OntarioTech university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AdamWong",
  "highlighted_projects": [
    {
      "description": "This project involved implementing a facial detection system using OpenCV in a QEMU emulator. Installation and loading of the modules necessary were particularly difficult to complete as the project continuously produced errors. Debugging was a lengthy process and much research was needed to diagnose what was the particular issue and discern what would be the best solution given the modules' purpose. One thing I gained from this experience was improving my research capability.",
      "name": "Embedded Systems SOFE4590u"
    },
    {
      "description": "Everyone has difficulty choosing where and what to eat in this day and age. To alleviate this stress my group and I wished to create a web app. After research and deliberation on what was possible given the time frame, we decided to create YourSpot. YourSpot grabs the list of the restaurants in your area using google API and generates information on each dish displaying allergens, reviews, and spice levels. To accomplish this within the given time my group had broken up the task list, and conducted regular meetings to ensure that the progression was acceptable. This was implemented using a python flask backend, SQL to hold the data in tables, and HTML/CSS to style the webpages",
      "git_url": "https://github.com/876ad/yourSpot",
      "name": "YourSpot"
    },
    {
      "description": "Created an EMI (Equated Monthly Installment) calculator android mobile app. This was my first android development project and while it was easier due to my background knowledge in Java there was a large amount of time spent debugging due to the small nuanced details of the constraints and information parsing. It was only with the thorough study of the developer documentation for Android Studio that allowed me to complete the views and layouts necessary for the EMI calculator.",
      "git_url": "https://github.com/876ad/mobileAssignment",
      "name": "EMI calculator"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Many companies/stakeholders which utilize Linux clusters to host processes or persist data need the constant analysis of their cluster of nodes in order to ensure the requirements listed in the associated BRD (Business Requirements Document) are met. The Linux Cluster Monitoring Agent greatly assists in this matter. Through the elicitation of the system(node) attributes and usage, modeling the data using SQL and an RDBMS schema we essentially create a SRD (System Reference Document). Allowing stakeholders to identifiy if any modifications to their current cluster is needed to increase the amount of nodes if the performance is lacking, or decrease the amount of nodes if those resources are not being utilized. With this the company which implements this can ensure the SLA between them and their stakeholders is satisified.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitoring Agent"
    }
  ],
  "name": "Adam Wong",
  "others": [
    {
      "bullets": [
        "Volunteer, JSPCA; helping rehome and provide care for young animals"
      ],
      "title": "Hobbies/activities"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Deployed a Linux/SQL project which monitors the system and usage attributes of each node to assess the viability of the current cluster. Through the constant and open communication of the Jarvis team, I was able to complete the project with little deviation, troubleshoot without worry, and ensure the project was implemented in the manner which was intended by the written user stories. ",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "JSPCA",
      "description": "Each day was dedicated to the care of cats and dogs both young and old who have either been abused or had been living in the streets, persisting in attempting to give care when the animals stopped trusting people, communicating with potential owners and analyzing to ensure that they were the right fit for the animal given the animal's temperament.",
      "duration": "2014",
      "title": "Assistant caretaker"
    }
  ],
  "skills": {
    "Business Skills": [
      "Communication",
      "Collaberation",
      "Critical Thinking",
      "Perserverance",
      "Excel",
      "Word"
    ],
    "Technical Skills": [
      "RDBMS/SQL",
      "Data Modeling/Mapping",
      "Data Analytics",
      "Linux",
      "GIT",
      "Python",
      "Java",
      "Docker",
      "Bash",
      "IOT"
    ]
  },
  "summary": "Throughout my academic and work experience, I have been introduced to a wide variety of people and technologies. With each experience, my overall mindset grew to fit each situation after determining which areas I needed to improve upon to get the most out of the experience. Whether it was learning how to communicate empathetically, efficiently, and concisely for a presentation or project meeting, analyzing and dissecting technologies to repurpose them for use in another project, or even learning when to ask for help after hitting a wall to ensure the project would be delivered on time. I choose to constantly improve with whatever comes my way. I have always been passionate about constant improvement and creation, and no other role is more suited for this type of passion than a developer role. "
}
